TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_unicommuart.h
    return (DL_UART_OVERSAMPLING_RATE)(rate);
}

/**
 *  @brief      Enable loopback mode
 *
 *  Enables the loopback mode. When enabled, the UNICOMMUARTxTXD path is fed through
 *  the UNICOMMUARTxRXD path.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_enableLoopbackMode(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 |= UNICOMMUART_CTL0_LBE_ENABLE;
}

/**
 *  @brief      Check if loopback mode is enabled
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of loopback mode
 *
 *  @retval     true  Loopback mode is enabled
 *  @retval     false Loopback mode is disabled
 */
__STATIC_INLINE bool DL_UART_isLoopbackModeEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->CTL0 & UNICOMMUART_CTL0_LBE_MASK) ==
            UNICOMMUART_CTL0_LBE_ENABLE);
}

/**
 *  @brief      Disable loopback mode
 *
 *  Disables the loopback mode. When disabled, the UNICOMMUARTxTXD path is not fed through
 *  the UNICOMMUARTxRXD path.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_disableLoopbackMode(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 &= ~(UNICOMMUART_CTL0_LBE_MASK);
}

/**
 *  @brief      Set the direction of the UART communication
 *
 *  If the UART is disabled in the middle of a transmit or receive, it
 *  completes the current character before stopping.
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
 *  @param[in]  direction  Direction to set UART communication to.
 *                         One of @ref DL_UART_DIRECTION.
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 *
 */
__STATIC_INLINE void DL_UART_setDirection(
    UNICOMM_Inst_Regs *unicomm, DL_UART_DIRECTION direction)
{
    DL_Common_updateReg(&unicomm->uart->CTL0, (uint32_t) direction,
        UNICOMMUART_CTL0_TXE_MASK | UNICOMMUART_CTL0_RXE_MASK);
}

/**
 *  @brief      Get the direction of the UART communication
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The direction of UART communication.
 *
 *  @retval     One of @ref DL_UART_DIRECTION
 */
__STATIC_INLINE DL_UART_DIRECTION DL_UART_getDirection(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t direction = unicomm->uart->CTL0 & (UNICOMMUART_CTL0_TXE_MASK |
                                                   UNICOMMUART_CTL0_RXE_MASK);

    return (DL_UART_DIRECTION)(direction);
}

/**
 *  @brief      Enable majority voting control
 *
 *  When enabled, the three center bits are used to determine received sample
 *  value. The value corresponding to at least two of the three samples is
 *  considered to be the received value.In case of error (i.e. all 3 bits are
 *  not the same), noise error is detected and bits RIS.NERR and register
 *  RXDATA.NERR are set.
 *
 *  When enabled with oversampling of 16, samples 7, 8, and 9 are
 *  majority voted to decide the sampled bit value.
 *
 *  When enabled with oversampling of 8, samples 3, 4, and 5 are majority
 *  voted to decide the sampled bit value. The value corresponding to at least 2
 *  of the 3 samples is considered to be the received value.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 *
 *  @sa          DL_UART_setOversampling
 */
__STATIC_INLINE void DL_UART_enableMajorityVoting(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 |= UNICOMMUART_CTL0_MAJVOTE_ENABLE;
}

/**
 *  @brief      Check if majority voting is enabled
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *
 *  @return     The status of majority control feature
 *
 *  @retval     true  Majority voting is enabled
 *  @retval     false Majority voting is disabled
 */
__STATIC_INLINE bool DL_UART_isMajorityVotingEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->CTL0 & UNICOMMUART_CTL0_MAJVOTE_MASK) ==
            UNICOMMUART_CTL0_MAJVOTE_ENABLE);
}

/**
 *  @brief      Disable majority voting control
 *
 *  When disabled, only a single sample of the received bit of is taken.
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_disableMajorityVoting(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 &= ~(UNICOMMUART_CTL0_MAJVOTE_MASK);
}

/**
 *  @brief      Enable most significant bit (MSB) first
 *
 *  When enabled, the most significant bit (MSB) is sent first in the protocol
 *  packet. This bit has effect on both the way the protocol byte is
 *  transmitted and received.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_enableMSBFirst(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 |= UNICOMMUART_CTL0_MSBFIRST_ENABLE;
}

/**
 *  @brief      Check if most significant bit (MSB) first is enabled
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *
 *  @return     The status of majority control feature
 *
 *  @retval     true  MSB first is enabled
 *  @retval     false MSB first is disabled
 */
__STATIC_INLINE bool DL_UART_isMSBFirstEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->CTL0 & UNICOMMUART_CTL0_MSBFIRST_MASK) ==
            UNICOMMUART_CTL0_MSBFIRST_ENABLE);
}

/**
 *  @brief      Disable most significant bit (MSB) first
 *
 *  When disabled, the least significant bit (LSB) is sent first in the protocol
 *  packet. This bit has effect on both the way the protocol byte is
 *  transmitted and received.
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_disableMSBFirst(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 &= ~(UNICOMMUART_CTL0_MSBFIRST_MASK);
}

/**
 *  @brief      Enable control of the TXD pin
 *
 *  When enabled, the TXD pin can be controlled by the TXD_OUT bit. The UNICOMMUART
 *  transmit section must first be disabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 *
 *  @sa          DL_UART_setDirection
 *  @sa          DL_UART_setTXDPin
 */
__STATIC_INLINE void DL_UART_enableTransmitPinManualControl(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 |= UNICOMMUART_CTL0_TXD_OUT_EN_ENABLE;
}

/**
 *  @brief      Check if control of the TXD pin is enabled
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *
 *  @return     The status of control of the TXD pin
 *
 *  @retval     true  Control of the TXD pin is enabled
 *  @retval     false Control of the TXD pin is disabled
 */
__STATIC_INLINE bool DL_UART_isTransmitPinManualControlEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->CTL0 & UNICOMMUART_CTL0_TXD_OUT_EN_MASK) ==
            UNICOMMUART_CTL0_TXD_OUT_EN_ENABLE);
}

/**
 *  @brief      Disable control of the TXD pin
 *
 *  When disabled, the TXD pin can not be controlled by the TXD_OUT bit
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_disableTransmitPinManualControl(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->CTL0 &= ~(UNICOMMUART_CTL0_TXD_OUT_EN_MASK);
}

/**
 *  @brief      Set the output of the TXD pin
 *
 *  Control the output transmit data pin only when TXD_OUT_EN is enabled and
 *  TXE is disabled.
 *
 *  The TXD pin is set to manual control if it hadn't been
 *  previously set.
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
 *  @param[in]  txdOutVal  Value to set the TXD pin output to.
 *                         One of @ref DL_UART_TXD_OUT
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 *
 *  @sa          DL_UART_disableTransmitPinManualControl
 *  @sa          DL_UART_enableTransmitPinManualControl
 */
__STATIC_INLINE void DL_UART_setTransmitPinManualOutput(
    UNICOMM_Inst_Regs *unicomm, DL_UART_TXD_OUT txdOutVal)
{
    DL_Common_updateReg(&unicomm->uart->CTL0,
        UNICOMMUART_CTL0_TXD_OUT_EN_ENABLE | (uint32_t) txdOutVal,
        UNICOMMUART_CTL0_TXD_OUT_EN_MASK | UNICOMMUART_CTL0_TXD_OUT_MASK);
}

/**
 *  @brief      Get the output value of the TXD pin
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The value of the TXD pin
 *
 *  @retval     One of @ref DL_UART_TXD_OUT
 */
__STATIC_INLINE DL_UART_TXD_OUT DL_UART_getTransmitPinManualOutput(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t txdOutVal = unicomm->uart->CTL0 & UNICOMMUART_CTL0_TXD_OUT_MASK;

